Австралия/src/Catalogs/POSTerminals/POSTerminals.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>POSTerminals</name>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>PettyCash</name>
    <type>
      <types>CatalogRef.CashRegisters</types>
    </type>
  </attributes>
  <attributes>
    <name>Peripherals</name>
    <type>
      <types>CatalogRef.Peripherals</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>UseWithoutEquipmentConnection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfPOS</name>
    <type>
      <types>EnumRef.TypesOfPOS</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentProcessor</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentProcessorContract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>WithholdFeeOnPayout</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Project</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PaymentCardKinds</name>
    <attributes>
      <name>ChargeCardKind</name>
      <type>
        <types>CatalogRef.PaymentCardTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>FeePercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FeeFixedPart</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/POSTerminals/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	
	NativeLanguagesSupportServer.ChoiceDataGetProcessing(
		ChoiceData,
		Parameters,
		StandardProcessing,
		Metadata.Catalogs.POSTerminals);
	
EndProcedure

Procedure PresentationGetProcessing(Data, Presentation, StandardProcessing)
	
	NationalLanguageSupportClientServer.PresentationGetProcessing(Data, Presentation, StandardProcessing);
	
EndProcedure

Procedure PresentationFieldsGetProcessing(Fields, StandardProcessing)
	
	NationalLanguageSupportClientServer.PresentationFieldsGetProcessing(Fields, StandardProcessing);
	
EndProcedure

#EndRegion

#Region ProgramInterface

Function GetObjectAttributesBeingLocked() Export
	Result = New Array;
	Return Result;
EndFunction

// Function defines the company, petty cash and currency of selected POS terminal.
//
// Parameters:
//  POSTerminal - CatalogRef.POSTerminals - Refs to POS-Terminal
//
// Returns:
//  Structure - Company, PettyCash and Currency of POS terminal
//
Function GetPOSTerminalAttributes(POSTerminal) Export
	
	Query = New Query("
	|SELECT ALLOWED
	|	POSTerminals.Company AS Company,
	|	POSTerminals.PettyCash AS PettyCash
	|FROM
	|	Catalog.POSTerminals AS POSTerminals
	|WHERE
	|	POSTerminals.Ref = &POSTerminal
	|");
	
	Query.SetParameter("POSTerminal", POSTerminal);
	
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Company = Selection.Company;
		PettyCash = Selection.PettyCash;
	Else
		Company = Undefined;
		PettyCash = Undefined;
	EndIf;
	
	AttributesStructure = New Structure("Company, PettyCash",
		Company,
		PettyCash
	);
	
	Return AttributesStructure;
	
EndFunction

// Function defines the POS terminal by selected petty cash.
//
// Returns POS terminal if one POS terminal is found.
// Returns Undefined if POS terminal is not found or there are more than one POS terminals.
//
// Parameters:
//  Company - CatalogRef.CashAccounts (CatalogRef.CashRegisters) - Ref to petty cash
//
// Returns:
// CatalogRef.POSTerminals - Found POS-Terminal
//
Function GetPOSTerminalByDefault(PettyCash) Export
	
	Query = New Query(
	"SELECT ALLOWED TOP 2
	|	POSTerminals.Ref AS POSTerminal
	|FROM
	|	Catalog.POSTerminals AS POSTerminals
	|WHERE
	|	POSTerminals.PettyCash = &PettyCash");
	
	Query.SetParameter("PettyCash", PettyCash);
	
	Selection = Query.Execute().Select();
	If Selection.Count() = 1 
	   AND Selection.Next()
	Then
		POSTerminal = Selection.POSTerminal;
	Else
		POSTerminal = Undefined;
	EndIf;
	
	Return POSTerminal;

EndFunction

// Procedure kind getting of payment cards accepted by the acquiring contract
//
// Parameters:
//  POSTerminal - CatalogRef.POSTerminals - Refs to POS-Terminal
//
// Return value:
//  Array - Kind array of payment cards
//
Function PaymentCardKinds(POSTerminal) Export
	
	ArrayTypesOfPaymentCards = New Array;
	
	If ValueIsFilled(POSTerminal) Then
		
		Query = New Query(
		"SELECT ALLOWED
		|	PaymentCardKinds.ChargeCardKind AS ChargeCardKind
		|FROM
		|	Catalog.POSTerminals.PaymentCardKinds AS PaymentCardKinds
		|WHERE
		|	PaymentCardKinds.Ref = &Ref");
		
		Query.SetParameter("Ref", POSTerminal);
		
		Selection = Query.Execute().Select();
		While Selection.Next() Do
			ArrayTypesOfPaymentCards.Add(Selection.ChargeCardKind);
		EndDo;
		
	EndIf;
	
	Return ArrayTypesOfPaymentCards;
	
EndFunction

Function GetFeeData(POSTerminal, ChargeCardKind) Export
	
	Result = New Structure("FeePercent, FeeFixedPart", 0, 0);
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED TOP 1
	|	POSTerminalsPaymentCardKinds.FeePercent AS FeePercent,
	|	POSTerminalsPaymentCardKinds.FeeFixedPart AS FeeFixedPart
	|FROM
	|	Catalog.POSTerminals.PaymentCardKinds AS POSTerminalsPaymentCardKinds
	|WHERE
	|	POSTerminalsPaymentCardKinds.Ref = &Ref
	|	AND POSTerminalsPaymentCardKinds.ChargeCardKind = &ChargeCardKind";
	
	Query.SetParameter("Ref", POSTerminal);
	Query.SetParameter("ChargeCardKind", ChargeCardKind);
	
	Sel = Query.Execute().Select();
	If Sel.Next() Then
		FillPropertyValues(Result, Sel);
	EndIf;
	
	Return Result;
	
EndFunction

#EndRegion

#EndIf
